tap "clementtsang/bottom"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/gitstatus"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# DuckDuckGo from the terminal
brew "ddgr"
# Tool for managing dock items
brew "dockutil"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Generic library support script
brew "libtool"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Search and News from the command-line
brew "googler"
# CLI email client written in Rust
brew "himalaya"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Extremely Fast Compression algorithm
brew "lz4"
# Implementation of the file(1) command
brew "libmagic"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Whole-program, optimizing compiler for Standard ML
brew "mlton"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Paragraph reflow for email
brew "par"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Parse HTML at the command-line
brew "pup"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to impose load on and stress test a computer system
brew "stress"
# Opinionated Lua code formatter
brew "stylua"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Bash completion for Vagrant
brew "vagrant-completion"
# Vi 'workalike' with many additional features
brew "vim"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# A cross-platform graphical process/system monitor with a customizable interface and a multitude of features.
brew "clementtsang/bottom/bottom"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Git status for Bash/Zsh prompt
brew "romkatv/gitstatus/gitstatus"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
cask "mark-text"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Speedtest", id: 1153157709
mas "Vimari", id: 1480933944
