tap "clementtsang/bottom"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/gitstatus"
brew "adns"
brew "bash"
brew "bash-completion@2"
brew "bashdb"
brew "bat"
brew "bdw-gc"
brew "openssl@1.1"
brew "broot"
brew "readline"
brew "sqlite"
brew "tcl-tk"
brew "xz"
brew "datamash"
brew "dockutil"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "htop"
brew "hyperfine"
brew "jq"
brew "lnav"
brew "mackup"
brew "mas"
brew "mlton"
brew "nnn"
brew "node"
brew "pinentry-mac"
brew "pup"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "stress"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "youtube-dl"
brew "zlib"
brew "clementtsang/bottom/bottom"
brew "heroku/brew/heroku"
brew "romkatv/gitstatus/gitstatus"
cask "brave-browser"
cask "calibre", args: { appdir: "~/Applications" }
cask "discord"
cask "emacs"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome", args: { appdir: "~/Applications" }
cask "iterm2"
cask "karabiner-elements"
cask "lunar"
cask "macs-fan-control"
cask "mark-text"
cask "pycharm-ce"
cask "racket"
cask "rectangle"
cask "slack"
cask "smlnj"
cask "spotify"
cask "vagrant", args: { appdir: "~/Applications" }
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zoom"
mas "Battery Monitor", id: 836505650
mas "Buffer", id: 1474298973
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "Hotspot Shield", id: 771076721
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "SHAREit", id: 1040029915
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
