# Brewfile
#
# Organized as:
#
# - Necessary taps
# - Brew formulae
# - Casks
# - Mac Applications

# Set argument for all `brew install --cask` commands
cask_args appdir: "~/Applications"

tap "clementtsang/bottom"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/gitstatus"

# Shells and related
brew "bash"
brew "bash-completion@2"
brew "bashdb"
brew "zsh"
brew "zsh-completion"
brew "shellcheck"                    # Linter
brew "romkatv/gitstatus/gitstatus"   # Fast git status prompt (bash/zsh)

# Programming languages and related
# Pre-requisites for pyenv Python install
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

brew "pyenv"                 # Python version management
brew "pyenv-virtualenv"      # Python virtual environment management
brew "rbenv"                 # Ruby virtual environment management
brew "node"
brew "go"                    # Go language

# Editors
brew "neovim", args: ["HEAD"]
brew "vim"

# System monitoring
brew "htop"
brew "lnav"
brew "clementtsang/bottom/bottom"    # Written in Rust

# File navigation, search and related
brew "bat"        # (cat) syntax highlighting
brew "broot"
brew "fd"         # better find
brew "fzf"        # fuzzy finder
brew "ripgrep"    # better grep
brew "tree"       # File tree viewer
# TODO: `brew edit nnn` O_NERD=1 for adding file icons
brew "nnn", args: ["HEAD", "build-from-source"]

# CLI utilities
brew "adns"
brew "bdw-gc"
brew "tcl-tk"
brew "ctags"
brew "datamash"
brew "docker-compose"
brew "dockutil"             # Manage Mac dock applications
brew "ffmpeg"               # Play, record, convert, and stream audio and video
brew "fontforge"            # Used for NERDFonts patcher script
brew "gh"                   # GitHub CLI client
brew "git"                  # Git
brew "gnupg"
brew "hyperfine"
brew "jq"                   # JSON processor
brew "less"                 # latest less
brew "mackup"               # Backup files
brew "mas"                  # Mac AppStore CLI
brew "mlton"
brew "pinentry-mac"
brew "pup"                  # Parse HTML at commandline
brew "pv"                   # Monitor data's progress through a pipe
brew "rename"
brew "stow"
brew "stress"
brew "tldr"                 # Better help
brew "tmux"                 # Terminal multiplexer
brew "youtube-dl"           # Download videos from Youtube and others
brew "heroku/brew/heroku"

# Completions
brew "docker-completion"
brew "vagrant-completion"


# Casks

# Browsers
cask "brave-browser"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"

# GUI Editors
cask "emacs"
cask "mark-text"    # Markdown editor
cask "pycharm-ce"
cask "racket"       # Includes DrRacket
cask "visual-studio-code"

# Chat
cask "discord"
cask "slack"
cask "whatsapp"
cask "zoom"

# Fonts (patched manually using NERDFont patcher)
# cask "font-fira-code-nerd-font"
# cask "font-jetbrains-mono-nerd-font"

# Terminals
cask "iterm2"
cask "kitty"

# Extensions
cask "karabiner-elements"     # Keyboard customizer for Mac
cask "lunar"                  # Control display/monitor brightness
cask "macs-fan-control"
cask "rectangle"              # Move/resize windows

# Virtual machine
cask "virtualbox"
cask "vagrant", args: { appdir: "~/Applications" }
cask "docker"

cask "calibre"         # ebooks
cask "qbittorrent"
cask "smlnj"
cask "spotify"
cask "vlc"
cask "wireshark"       # Network monitoring


# Mac applications
mas "Battery Monitor", id: 836505650
mas "Buffer", id: 1474298973
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "Hotspot Shield", id: 771076721
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "SHAREit", id: 1040029915
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
